#+TITLE:Alternate Braitenbot Code 
#+AUTHOR: Jake Brawer, Aaron Hill
#+EMAIL: jabrawer@vassar.edu, aahill@vassar.edu
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+BABEL: :session *python* :cache yes :results output graphics :exports both 

This code is essentially identical to Braitenbot Code except that there was a slight modification
made to PinGroups. Additinally, I changed a few other files that had pingroup as a dependency. New files
are prefixed by "Alternate"
 
*** Test:
#+BEGIN_SRC python :noweb yes :results output 
  <<Pin>>

  p = pin(3,4,5)
  print p.group_id
  print p.number 

#+END_SRC

#+RESULTS:
: 3
: 4

**** Test 
#+BEGIN_SRC python :noweb yes :results output :tangle testy.py
  # Need these to test match_and_remove_pins
  <<Pin>>
  <<PinGroup>> 
   
  pin1 = pin(2,1,1)
  pin2 = pin(1,3,4)
  piny = pin(1,1,1) #piny is identical to pin1, thus pin1 should be made unavailable
  pingroup= PinGroup()

  list1 = [pin2, pin1]
  print "pin1 avaialability before match_and_remove is called:", pin1.available 
  pingroup.match_and_remove_pin(piny, list1)
  print "Pin1 availability after:", pin1.available 

#+END_SRC

#+RESULTS:
: pin1 avaialability before match_and_remove is called: True
: Pin1 availability after: True

*** Validation
Validating that the various intended properities of an InstructionSet hold
#+BEGIN_SRC python :results output :noweb yes
  <<BaseAndInstructionSet_Imports>>
  <<Base>>
  <<InstructionSet>>

  def instruction_set_test(val,size, crossover_point_num, distro, gene_length):
      print '%s InstructionSets generated, each should have %s crossover points:' % (val, crossover_point_num)
      while val > 0:
          crossover_ps  = 0
          genome = InstructionSet(size, crossover_point_num,distro, gene_length)
          length = len(genome.genome)
          for i in range (len(genome.genome)):
              #print g.char, 
              if genome.genome[i].crossover_point == 1:
                  print '\nCO_point at index: %s' % i
                  crossover_ps += 1
          print
          print 'InstructionSet %s length: %s, # of Crossover_points: %s' % (11 -val, length, crossover_ps)
          print
          val -= 1


  instruction_set_test(10, 20,2, True, 5)
#+END_SRC
#+RESULTS:
#+begin_example
10 InstructionSets generated, each should have 2 crossover points:

CO_point at index: 8

CO_point at index: 13

InstructionSet 1 length: 20, # of Crossover_points: 2


CO_point at index: 0

CO_point at index: 8

InstructionSet 2 length: 20, # of Crossover_points: 2


CO_point at index: 11

CO_point at index: 16

InstructionSet 3 length: 20, # of Crossover_points: 2


CO_point at index: 10

CO_point at index: 15

InstructionSet 4 length: 20, # of Crossover_points: 2


CO_point at index: 5

CO_point at index: 14

InstructionSet 5 length: 20, # of Crossover_points: 2


CO_point at index: 0

CO_point at index: 16

InstructionSet 6 length: 20, # of Crossover_points: 2


CO_point at index: 13

CO_point at index: 18

InstructionSet 7 length: 20, # of Crossover_points: 2


CO_point at index: 1

CO_point at index: 8

InstructionSet 8 length: 20, # of Crossover_points: 2


CO_point at index: 1

CO_point at index: 5

InstructionSet 9 length: 20, # of Crossover_points: 2


CO_point at index: 0

CO_point at index: 9

InstructionSet 10 length: 20, # of Crossover_points: 2

#+end_example

**** Validation
Vaidatinf that the function mutate mutates and InstructonSet as many times as expected
#+BEGIN_SRC python :noweb yes :results output
  <<BaseAndInstructionSet_Imports>>
  <<Base>>
  <<InstructionSet>>
  def mutation_test(val):
      print 'Results of running mutate %s times ' % val
      genome = InstructionSet(2000, 2, True, 20)
      count = 0
      for i in range (0, val):
          if genome.mutate():
              count += 1
      print 'For each Base in InstructionSet, there is 2/20000 of the Base being mutated.\n There %s bases in an InstructionSet therefore the probability of no mutations taking place is (19998/20000)^2000.\n Thus in %s calls to  mutate there should be  (1 - (19998/20000)^2000)*%s ~ %s mutations.\n  The actual number of mutations: %s' % (2000, val,val, (1- ((19998./20000.)**2000)) * val,count)

  mutation_test(100)
#+END_SRC

#+RESULTS:
#+begin_example
Results of running mutate 100 times 
Char mutation at index: 1731
0 --> 1
Crossover_point mutation at index: 1927
0 --> 1
Char mutation at index: 1016
0 --> 1
Crossover_point mutation at index: 286
0 --> 1
Char mutation at index: 394
1 --> 0
Crossover_point mutation at index: 783
0 --> 1
Char mutation at index: 1730
0 --> 1
Crossover_point mutation at index: 1438
0 --> 1
Crossover_point mutation at index: 423
0 --> 1
Crossover_point mutation at index: 1539
0 --> 1
Char mutation at index: 679
0 --> 1
Crossover_point mutation at index: 1733
0 --> 1
Crossover_point mutation at index: 1841
0 --> 1
Char mutation at index: 106
0 --> 1
Crossover_point mutation at index: 408
0 --> 1
Crossover_point mutation at index: 485
0 --> 1
Crossover_point mutation at index: 1180
0 --> 1
For each Base in InstructionSet, there is 2/20000 of the Base being mutated.
 There 2000 bases in an InstructionSet therefore the probability of no mutations taking place is (19998/20000)^2000.
 Thus in 100 calls to  mutate there should be  (1 - (19998/20000)^2000)*100 ~ 18.1277434734 mutations.
  The actual number of mutations: 16
#+end_example

